In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: prettytable<1 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython>=1.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (7.12.0)
Requirement already satisfied: sqlparse in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: six in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (1.14.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (1.3.13)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: traitlets>=4.2 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.3)
Requirement already satisfied: pygments in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.5.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (45.2.0.post20200210)
Requirement already satisfied: decorator in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.1)
Requirement already satisfied: jedi>=0.10 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.14.1)
Requirement already satisfied: pickleshare in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: wcwidth in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.8)
Requirement already satisfied: parso>=0.5.0 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.2)

In [2]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (2.8.6)

In [3]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\tijesunimi2-pc\anaconda3\lib\site-packages (1.3.13)

In [4]:
%load_ext sql

In [5]:
import psycopg2

In [6]:
from sqlalchemy import create_engine

In [7]:
# Example format
%sql postgresql://postgres:tijesunimi@localhost/10acad_moodle

#### Write an SQL script to count the number of tables

In [49]:
%%sql

SELECT COUNT(*)
  FROM INFORMATION_SCHEMA.TABLES
 WHERE table_catalog = '10acad_moodle'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(642,)]

In [44]:
%%sql

SELECT COUNT(*)
  FROM INFORMATION_SCHEMA.COLUMNS
 WHERE table_catalog = '10acad_moodle'
   AND table_name = 'mdl_context_temp'

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(4,)]

#### Write an SQL script to count the number of records in each of the tables given in the MIT section

In [120]:
mit_sesssion = ['mdl_logstore_standard_log', 'mdl_context', 'mdl_user', 'mdl_course', 'mdl_modules',
                'mdl_course_modules', 'mdl_course_modules_completion', 'mdl_grade_items', 'mdl_grade_grades',
                'mdl_grade_categories', 'mdl_grade_items_history', 'mdl_grade_grades_history', 
                'mdl_grade_categories_history', 'mdl_forum', 'mdl_forum_discussions', 'mdl_forum_posts'
]

In [121]:
%%sql

SELECT (SELECT COUNT(*) FROM mdl_logstore_standard_log) as mdl_logstore_standard_log,
  (SELECT COUNT(*) FROM mdl_context) as mdl_context,
    (SELECT COUNT(*) FROM mdl_user) as mdl_user,
      (SELECT COUNT(*) FROM mdl_course) as mdl_course,
        (SELECT COUNT(*) FROM mdl_modules) as mdl_modules,
         (SELECT COUNT(*) FROM mdl_course_modules) as mdl_course_modules, 
            (SELECT COUNT(*) FROM mdl_course_modules_completion) as mdl_course_modules_completion,
               (SELECT COUNT(*) FROM mdl_grade_items) as mdl_grade_items

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(417554, 4359, 1052, 15, 26, 290, 4483, 113)]

In [124]:
%%sql

SELECT (SELECT COUNT(*) FROM mdl_grade_grades) as mdl_grade_grades,
          (SELECT COUNT(*) FROM mdl_grade_categories) as mdl_grade_categories,
             (SELECT COUNT(*) FROM mdl_grade_items_history) as mdl_grade_items_history,
                (SELECT COUNT(*) FROM mdl_grade_grades_history) as mdl_grade_grades_history,
                  (SELECT COUNT(*) FROM mdl_grade_categories_history) as mdl_grade_categories_history,
                    (SELECT COUNT(*) FROM mdl_forum) as mdl_forum,
                      (SELECT COUNT(*) FROM mdl_forum_discussions) as mdl_forum_discussions,
                        (SELECT COUNT(*) FROM mdl_forum_posts) as mdl_forum_posts

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(3643, 16, 486, 7108, 46, 34, 23, 131)]

#### Write an SQL script to count the Monthly usage time of learners who have confirmed and are not deleted

In [74]:
%%sql

SELECT * FROM mdl_user LIMIT 5

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE'),
 (36, 1, 0, 0, 0, '', 'Ghana', 'en', 1549641288, 1559227964, 1549651186, 1559227892, '154.160.1.224', 'Male', 'GH'),
 (44, 1, 0, 0, 0, '', 'Ghana', 'en', 1549637001, 1560095090, 1557475553, 1560094908, '129.122.1.14', 'Male', 'GH')]

In [89]:
%%sql

SELECT COUNT(confirmed) as confirmed_Learners FROM mdl_user WHERE confirmed = 1

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(1052,)]

In [91]:
monthly_usage_time = 1052 / 12
monthly_usage_time

87.66666666666667

#### Count of log events per user for the following verbs: ['loggedin', 'viewed', 'started', ,'submitted', 'uploaded', 'updated', 'searched', 'resumed', 'answered', 'attempted', 'abandoned']

In [109]:
%%sql

SELECT * FROM mdl_logstore_standard_log LIMIT 5

 * postgresql://postgres:***@localhost/10acad_moodle
5 rows affected.

[(1, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548311114, 'web', '105.233.48.139', None),
 (2, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548311148, 'web', '105.233.48.139', None),
 (3, '\\core\\event\\dashboard_viewed', 'core', 'viewed', 'dashboard', None, None, 'r', 0, 5, 30, 2, 2, 0, 2, 0, 'N;', 1548311179, 'web', '105.233.48.139', None),
 (4, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548313994, 'web', '105.233.48.139', None),
 (5, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548319150, 'web', '41.13.254.147', None)]

In [115]:
%%sql

SELECT 
  (SELECT COUNT(action) AS loggedin FROM mdl_logstore_standard_log WHERE action = 'loggedin'),
    (SELECT COUNT(action) AS viewed FROM mdl_logstore_standard_log WHERE action = 'viewed'), 
      (SELECT COUNT(action) AS started FROM mdl_logstore_standard_log WHERE action = 'started'),
        (SELECT COUNT(action) AS submitted FROM mdl_logstore_standard_log WHERE action = 'submitted'),
          (SELECT COUNT(action) AS uploaded FROM mdl_logstore_standard_log WHERE action = 'uploaded'),
            (SELECT COUNT(action) AS updated FROM mdl_logstore_standard_log WHERE action = 'updated'),
              (SELECT COUNT(action) AS searched FROM mdl_logstore_standard_log WHERE action = 'searched'),
                (SELECT COUNT(action) AS resumed FROM mdl_logstore_standard_log WHERE action = 'resumed'),
                  (SELECT COUNT(action) AS answered FROM mdl_logstore_standard_log WHERE action = 'answered'),
                    (SELECT COUNT(action) AS attempted FROM mdl_logstore_standard_log WHERE action = 'attempted'),
                      (SELECT COUNT(action) AS abandoned FROM mdl_logstore_standard_log WHERE action = 'abandoned')

 * postgresql://postgres:***@localhost/10acad_moodle
1 rows affected.

[(4444, 120167, 3679, 2288, 173, 9657, 14, 1422, 362, 0, 5)]

#### Write a python class to pull Overall grade of learners for Number of forum posts

In [146]:
%%sql

SELECT * FROM mdl_forum_posts LIMIT 3

 * postgresql://postgres:***@localhost/10acad_moodle
3 rows affected.

[(1, 1, 0, 2, 1548435938, 1548444475, 1, 'Deployment', '<p>This website is still in testing mode. Public release date: 28 Jan 2019! Stay tuned!</p><p><span class="edited">(Edited by <a href="https://moodle.10academy.org/user/view.php?id=3&amp;course=1">Arun Sharma</a> - original submission Friday, 25 January 2019, 6:05 PM)</span></p>', 1, 0, '', 0, 0, 0),
 (3, 3, 0, 2, 1549622897, 1549622897, 1, '2019 Potential Fellows', '<p>We are happy to announce that this platform is officially kick-started, and the 2017 10 Academy Fellows and the the first batch of the 2019 Potential Fellows are included in the system.&nbsp;<br></p><p>Exciting future ahead!</p>', 1, 0, '', 0, 0, 0),
 (4, 4, 0, 3, 1549649825, 1549649825, 1, 'New Pattern Match!', '<p>Hello, the old Pattern Match course was not functioning properly - a new course (Pattern Match (new)) has been added.&nbsp; Sorry for the hassle. -as</p>', 1, 0, '', 0, 0, 0)]

In [137]:
%%sql

SELECT * FROM mdl_grade_grades LIMIT 3

 * postgresql://postgres:***@localhost/10acad_moodle
3 rows affected.

[(2, 92, 3, None, Decimal('100.00000'), Decimal('0.00000'), None, None, None, 0, 0, 0, 0, 0, 0, None, 0, None, 0, None, None, 'unknown', None),
 (1, 93, 3, None, Decimal('10.00000'), Decimal('0.00000'), None, 3, None, 0, 0, 0, 0, 0, 0, None, 0, None, 0, None, None, 'novalue', Decimal('0.00000')),
 (51, 126, 50, None, Decimal('12.00000'), Decimal('0.00000'), None, None, Decimal('12.00000'), 0, 0, 0, 0, 0, 0, None, 0, None, 0, None, 1549723271, 'unknown', None)]

#### Used INNERJOIN to connect the number of forum posts table to the grades table

In [157]:
%%sql

SELECT mdl_forum_posts.subject, mdl_grade_grades.rawgrademax
FROM mdl_forum_posts
INNER JOIN mdl_grade_grades ON mdl_forum_posts.userid = mdl_grade_grades.userid LIMIT 20

 * postgresql://postgres:***@localhost/10acad_moodle
20 rows affected.

[('Deployment', Decimal('100.00000')),
 ('Deployment', Decimal('2.00000')),
 ('Deployment', Decimal('100.00000')),
 ('Deployment', Decimal('100.00000')),
 ('Deployment', Decimal('10.00000')),
 ('2019 Potential Fellows', Decimal('100.00000')),
 ('2019 Potential Fellows', Decimal('2.00000')),
 ('2019 Potential Fellows', Decimal('100.00000')),
 ('2019 Potential Fellows', Decimal('100.00000')),
 ('2019 Potential Fellows', Decimal('10.00000')),
 ('What do you know about data science?', Decimal('100.00000')),
 ('What do you know about data science?', Decimal('2.00000')),
 ('What do you know about data science?', Decimal('100.00000')),
 ('What do you know about data science?', Decimal('100.00000')),
 ('What do you know about data science?', Decimal('10.00000')),
 ('Update your profile!', Decimal('100.00000')),
 ('Update your profile!', Decimal('2.00000')),
 ('Update your profile!', Decimal('100.00000')),
 ('Update your profile!', Decimal('100.00000')),
 ('Update your profile!', Decimal('10.00000'))]